#+AUTHOR: Einar Elén
#+EMAIL: einar.elen@gmail.com
#+OPTIONS: toc:3 html5-fancy:t org-html-preamble:nil
#+HTML_DOCTYPE_HTML5: t
#+PROPERTY: header-args :tangle yes :comments both
#+STARTUP: noinlineimages

* Some optimization
  #+BEGIN_SRC emacs-lisp
    (setq load-prefer-newer t)
    ;;; Temporarily reduce garbage collection during startup. Inspect `gcs-done'.
    (defun ambrevar/reset-gc-cons-threshold ()
      (setq gc-cons-threshold (car (get 'gc-cons-threshold 'standard-value))))
    (setq gc-cons-threshold (* 64 1024 1024))
    (add-hook 'after-init-hook #'ambrevar/reset-gc-cons-threshold)

    ;;; Temporarily disable the file name handler.
    ;; (setq default-file-name-handler-alist file-name-handler-alist)
    ;; (setq file-name-handler-alist nil)
    ;; (defun ambrevar/reset-file-name-handler-alist ()
    ;;   (setq file-name-handler-alist
    ;; 	(append default-file-name-handler-alist
    ;; 		file-name-handler-alist))
    ;;   (cl-delete-duplicates file-name-handler-alist :test 'equal))
    ;; (add-hook 'after-init-hook #'ambrevar/reset-file-name-handler-alist)
  #+END_SRC

  #+RESULTS:
  | ambrevar/reset-gc-cons-threshold | x-wm-set-size-hint | tramp-register-archive-file-name-handler |
** Dealing with local files 
#+NAME: loc-files
#+BEGIN_SRC emacs-lisp :tangle init.el
  (defcustom user-emacs-config-directory
    (file-name-as-directory 
    (expand-file-name "~/.config/emacs/"))
	  "The emacs configuration directory."
	  :type 'string
	  :group :elib-file-paths)
    (setq user-emacs-directory
	   (file-name-as-directory
	    (expand-file-name (concat
			       "~/.config/emacs/"
			       "machine-local-files"))))

    (defalias 'yes-or-no-p 'y-or-n-p)
    (setq recentf-save-file (expand-file-name "recentf" user-emacs-directory))
     (setq auto-save-list-file-prefix (concat
     user-emacs-directory "auto-save-list/.saves"))
     (setq auto-revert-verbose nil)
  (setq custom-file (concat user-emacs-directory "emacs-managed-customizations.el"))
#+END_SRC

#+RESULTS:
: /home/einarelen/.config/emacs/machine-local-files/emacs-managed-customizations.el

